Revit 2027 API
BuiltInFailures.AssemblyFailures.NoElementsLeftInExistingAssembly Property
 There are no elements left in the assembly. It will be disassembled.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoElementsLeftInExistingAssembly { get; }
Public Shared ReadOnly Property NoElementsLeftInExistingAssembly As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoElementsLeftInExistingAssembly {
	FailureDefinitionId^ get ();
}
static member NoElementsLeftInExistingAssembly : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AssemblyFailures Class
Autodesk.Revit.DB Namespace